Table of Contents
 Class IdeaWeld
Namespace
IdeaStatiCa.BimApiLink.BimApi
Assembly
IdeaStatiCa.BimApiLink.dll
public class IdeaWeld : AbstractIdeaObject<IIdeaWeld>, IEquatable<AbstractIdeaObject<IIdeaWeld>>, IIdeaWeld, IIdeaPersistentObject, IIdeaObject
Inheritance
object
ScopeAwareObject
BimLinkObject
AbstractIdeaObject<IIdeaWeld>
IdeaWeld
Implements
IEquatable<AbstractIdeaObject<IIdeaWeld>>
IIdeaWeld
IIdeaPersistentObject
IIdeaObject
Inherited Members
 AbstractIdeaObject<IIdeaWeld>.Id
 AbstractIdeaObject<IIdeaWeld>.Name
 AbstractIdeaObject<IIdeaWeld>.Identifier
 AbstractIdeaObject<IIdeaWeld>.GetHashCode()
 AbstractIdeaObject<IIdeaWeld>.Equals(object)
 AbstractIdeaObject<IIdeaWeld>.Equals(AbstractIdeaObject<IIdeaWeld>)
 BimLinkObject.Get<T>(Identifier<T>)
 BimLinkObject.Get<T>(int)
 BimLinkObject.Get<T>(string)
 BimLinkObject.GetMaybe<T>(Identifier<T>)
 BimLinkObject.GetMaybe<T>(int)
 BimLinkObject.GetMaybe<T>(string)
 BimLinkObject.CountryCode
 BimLinkObject.UserData
 ScopeAwareObject.Scope
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Constructors
 IdeaWeld(Identifier<IIdeaWeld>)
protected IdeaWeld(Identifier<IIdeaWeld> identifer)
Parameters
identifer Identifier<IIdeaWeld>
 IdeaWeld(int)
public IdeaWeld(int id)
Parameters
id int
 IdeaWeld(string)
public IdeaWeld(string id)
Parameters
id string
Properties
 ConnectedParts
Collection of part witch should be welded
public IEnumerable<IIdeaObjectConnectable> ConnectedParts { get; set; }
Property Value
IEnumerable<IIdeaObjectConnectable>
 End
End node of the weld line. Could be same as start point
public virtual IIdeaNode End { get; set; }
Property Value
IIdeaNode
 Material
Material of the plate.
public virtual IIdeaMaterial Material { get; set; }
Property Value
IIdeaMaterial
 Start
Start node of the weld line.
public virtual IIdeaNode Start { get; set; }
Property Value
IIdeaNode
 Thickness
public double Thickness { get; set; }
Property Value
double
 Token
Persistence token. Holds data neccessery to recreated the object in future.
public virtual IIdeaPersistenceToken Token { get; set; }
Property Value
IIdeaPersistenceToken
 WeldType
Type of weld
public WeldType WeldType { get; set; }
Property Value
WeldType
 Edit this page